const dictionary = [
[
["это","これは〜です"],
["дом","家"],
["комната","部屋"],
["мама","ママ"],
["окно","窓"],
["папа","パパ"],
["стол","机"],
["стул","椅子"],
["дома","家で（副詞）"],
["там","そこ・あそこに"],
["вот","ほら、"],
["и","と（並列）"]
],
[
["я","私"],
["вы","あなた（尊称）・あなたたち"],
["вода","水"],
["газета","新聞"],
["книга","本"],
["море","海"],
["озеро","湖"],
["парк","公園"],
["профессор","教授"],
["река","川"],
["сок","ジュース"],
["студент","大学生"],
["студентка","女子大学生"],
["здесь","ここ・ここに"],
["да","はい"],
["нет","いいえ"],
["не","〜でない（否定の助詞）"]
],
[
["кто","誰"],
["что","何・〜ということ"],
["где","どこ"],
["он","彼"],
["она","彼女"],
["они","彼ら"],
["брат","兄弟"],
["журнал","雑誌"],
["журналист","ジャーナリスト"],
["почта","郵便局"],
["сестра","姉妹"],
["словарь","辞書"],
["учитель","教師"],
["японка","日本人女性"],
["тоже","も"]
],
[
["мы","私たち"],
["оно","それ（三人称中性）"],
["ты","あなた"],
["ваш","あなたたちの"],
["его","彼の"],
["её","彼女の"],
["их","彼らの"],
["мой","私の"],
["наш","私たちの"],
["твой","あなたの"],
["чей","誰の"],
["дядя","おじさん"],
["имя","名前"],
["музей","博物館"],
["неделя","週"],
["писатель","作家"],
["письмо","手紙"],
["поле","平原"],
["родители","両親"],
["тетрадь","ノート"],
["учебник","教科書"],
["а","一方（対比の接続詞）"],
["место","場所・席"],
["площадь","広場"],
["слово","単語・言葉"],
["собака","犬"],
["тётя","おば"],
["часы","時計"],
["школа","学校"],
["бабушка","おばあさん"],
["врач","医者"],
["дедушка","おじいさん"],
["мать","母"],
["отец","父"],
["семья","家族"],
["фотография","写真"],
["рядом","隣に"],
["справа","右に"]
],
[
["этот","この"],
["город","町"],
["платье","ドレス"],
["радио","ラジオ"],
["какой","どんな・どのような"],
["молодой","若い"],
["новый","新しい"],
["синий","青い"],
["старый","古い"],
["хорошо","よく（副詞）"],
["делать","する（不完）"],
["знать","知っている"],
["слушать","聞く"],
["читать","読む（不完）"],
["или","もしくは"],
["рассказ","短篇小説"],
["интересный","面白い・興味深い"],
["красивый","美しい"],
["летний","夏の"],
["работать","働く"],
["сегодня","今日"],
["вечер","夕方・晩"],
["день","一日・昼"],
["погода","天気"],
["преподаватель","先生"],
["текст","テキスト・文"],
["урок","課・授業"],
["утро","朝"],
["добрый","良い・優しい"],
["хороший","良い（形容詞）"],
["громко","大声で（副詞）"],
["медленно","ゆっくりと（副詞）"],
["потом","後で（副詞）"],
["сейчас","今"],
["отвечать","答える（不完）"],
["понимать","理解する"],
["спрашивать","尋ねる・訊く（不完）"],
["и..., и...","...も、...も"]
],
[
["полка","棚"],
["русский","ロシア人"],
["столовая","食堂"],
["язык","言語"],
["большой","大きい"],
["плохой","悪い"],
["русский","ロシアの"],
["говорить","言う（不完）"],
["изучать","勉強する・研究する（不完）"],
["лежать","横たわる・横たえる"],
["смотреть","見る（不完）"],
["стоять","立っている"],
["в","〜（の中）で（＋前置格）、〜へ（＋対格）"],
["на","〜（の上）で（＋前置格）、〜へ（＋対格）"],
["о","〜について"],
["завод","工場"],
["восток","東"],
["запад","西"],
["телевизор","テレビ"],
["фильм","映画"],
["летом","夏に（副詞）"],
["очень","とても"],
["плохо","悪く（副詞）"],
["отдыхать","休む（不完）"],
["по-английски","英語で"],
["по-русски","ロシア語で"],
["по-японски","日本語で"],
["аудитория","教室"],
["американский","アメリカの"],
["английский","英語の"],
["немного","少し（副詞）"],
["уже","すでに・もう（副詞）"],
["разговаривать","会話する"]
],
[
["библиотека","図書館"],
["волос","髪"],
["голос","声"],
["дети","子どもたち"],
["концерт","コンサート"],
["машина","車"],
["университет","大学"],
["центр","中心"],
["русско-японский","露日の"],
["светлый","明るい"],
["вечером","夕方に（副詞）"],
["вчера","昨日"],
["никогда","決して〜ない"],
["тогда","その時"],
["когда","いつ"],
["быть","いる、ある（過去形や未来形で使われる）"],
["есть","いる、ある"],
["нет","ない、存在しない"],
["у","〜の所に、〜のそばに"],
["билет","チケット"],
["лекция","講義"],
["математика","数学"],
["метро","地下鉄"],
["подруга","女性の友達"],
["улица","道、通り"],
["футбол","サッカー"],
["гулять","散歩する・遊ぶ"],
["но","しかし・でも"],
["глаза","目（複数形）"],
["девочка","（幼い）女の子"],
["дочка","娘"],
["муж","夫"],
["японец","日本人男性"],
["всё","全部"],
["весёлый","陽気な"],
["высокий","（背・標高が）高い"],
["маленький","小さい"],
["тёмный","暗い"],
["чёрный","黒い"],
["ещё","まだ"],
["рассказывать","話す・語る（不完）"]
],
[
["автобус","バス"],
["молоко","牛乳"],
["поезд","長距離列車"],
["север","北"],
["фамилия","姓・名字"],
["чай","茶"],
["как","どのように"],
["куда","どこに"],
["ехать","乗って行く（定動詞）"],
["жить","生活する・生きる"],
["звать","呼ぶ"],
["идти","歩いて行く（定動詞）"],
["писать","書く（不完）"],
["пить","飲む"],
["строить","建てる（不完）"],
["кофе","コーヒー"],
["литература","文学"],
["статья","記事・論文"],
["юг","南"],
["встречать","会う・出迎える"],
["актёр","俳優"],
["вокзал","駅"],
["кино","映画館"],
["работа","仕事・職場"],
["известный","有名な"],
["китайский","中国の・中国人の"],
["много","たくさん"],
["поздно","（時間的に）遅く・遅れて"],
["раньше","早く、かつては"],
["играть","遊ぶ・演じる"],
["здравствуйте","こんにちは（正式）"],
["здравствуй","こんにちは（略式）"],
["до завтра","また明日"],
["до свидания","さようなら"]
],
[
["дождь","雨"],
["музыка","音楽"],
["подарок","プレゼント"],
["товарищ","同志・同僚・友人"],
["экзамен","試験"],
["каждый","毎・各"],
["домой","家に・家へ"],
["завтра","明日"],
["послезавтра","明後日"],
["так","そのように・そんなに"],
["помогать","助ける・手伝う（不完）"],
["можно","〜できる・〜してもよい"],
["надо","〜する必要がある・〜しなければならない"],
["нельзя","〜してはいけない・〜できない"],
["нужно","〜しなければならない"],
["пора","〜する時間だ"],
["к","〜（人）のほうに、〜の所に（＋与格）"],
["по","〜（線）に沿って、〜（空間）じゅうを（＋与格）"],
["понедельник","月曜日"],
["вторник","火曜日"],
["среда","水曜日"],
["четверг","木曜日"],
["пятница","金曜日"],
["суббота","土曜日"],
["воскресенье","日曜日"],
["друг","友達"],
["история","歴史"],
["зимой","冬に（副詞）"],
["осенью","秋に（副詞）"],
["летом","夏に（副詞）"],
["весной","春に（副詞）"],
["зима","冬"],
["осень","秋"],
["лето","夏"],
["весна","春"],
["скоро","もうすぐ・まもなく"],
["конечно","もちろん"],
["завтрак","朝ごはん"],
["ночь","夜"],
["обед","昼ごはん"],
["ресторан","レストラン"],
["ужин","夕ごはん"],
["всегда","いつも・常に"],
["днём","昼に"],
["ночью","夜に"],
["утром","朝に"],
["часто","よく・しばしば"],
["завтракать","朝食をとる（不完）"],
["обедать","昼食をとる（不完）"],
["ужинать","夕食をとる（不完）"],
["после","〜の後で（＋生格）"],
["потому что","なぜなら"]
],
[
["здание","建物"],
["карандаш","鉛筆"],
["ручка","ペン"],
["вместе","一緒に"],
["готовить","準備する・用意する（不完）"],
["заниматься","する（＋造格）"],
["любить","愛する・好む"],
["нравиться","気に入っている（不完）"],
["строиться","建てられる"],
["учиться","学ぶ・在学している"],
["хотеть","欲しい・したい"],
["с","〜とともに・〜付きの（＋造格）・〜から（＋生格）"],
["ложка","スプーン"],
["портрет","ポートレート・肖像"],
["суп","スープ"],
["теннис","テニス"],
["есть","食べる"],
["называться","（物が）〜と呼ばれる"],
["рисовать","描く"],
["играть в теннис","テニスをする"],
["гитара","ギター"],
["курс","学年"],
["сказка","おとぎ話"],
["спорт","スポーツ"],
["первый","第一の・一番目の"],
["сам","〜自身"],
["иногда","時々"],
["прекрасно","素晴らしく・見事に（副詞）"],
["играть на гитаре","ギターを弾く"]
],
[
["самолёт","飛行機"],
["снег","雪"],
["сын","息子"],
["такси","タクシー"],
["театр","劇場"],
["кто-то","誰か"],
["откуда","どこから"],
["отсюда","ここから"],
["оттуда","そこから・あそこから"],
["сюда","ここへ"],
["туда","そこへ・あそこへ"],
["бежать","走る（定動詞）"],
["бегать","走る（不定動詞）"],
["везти","乗り物で運ぶ（定動詞）"],
["возить","乗り物で運ぶ（不定動詞）"],
["вести","連れて行く（定動詞）"],
["водить","連れて行く（不定動詞）"],
["возвращаться","戻る・帰る"],
["ездить","乗り物で行く（不定動詞）"],
["лететь","飛ぶ（定動詞）"],
["летать","飛ぶ（不定動詞）"],
["нести","持って行く（定動詞）"],
["носить","持って行く（不定動詞）"],
["ходить","歩いて行く（不定動詞）"],
["чистить","綺麗にする"],
["из","〜（中）から（＋生格）"],
["от","〜（人）から（＋生格）"],
["сад","庭"],
["детский","子どもの"],
["долго","長い間"],
["пешком","徒歩で"],
["думать","考える"],
["детский сад","幼稚園"],
["двор","中庭"],
["дорога","道・道路"],
["остановка","停留所"],
["рука","手"],
["любимый","お気に入りの"],
["назад","前（過去）へ・後ろ（逆方向）へ"],
["обычно","普段・普通"],
["радостно","嬉しそうに・喜んで"],
["спокойно","落ち着いて"],
["теперь","今は"],
["брать","取る（不完）"],
["останавливаться","（乗り物が）止まる・（人が）立ち止まる"],
["садиться","座る・乗り物に乗る（в＋対格）（不完）"],
["до","〜まで（＋生格）"]
],
[
["читатель","読者"],
["близкий","近い"],
["больной","病気な"],
["жаркий","暑い"],
["занятый","忙しい・埋まっている"],
["рад","嬉しい"],
["свободный","自由な・空いている"],
["тёплый","暖かい"],
["трудный","難しい"],
["холодный","冷たい・寒い"],
["сколько","どれくらい（数量）"],
["мало","少しの・僅かな"],
["видеть","見る・会う"],
["получать","受け取る（不完）"],
["должен","〜しなければならない（形容詞短語尾）"],
["квартира","アパート・マンションの一区画"],
["мясо","肉"],
["телефон","電話"],
["учительница","女性の先生"],
["готовый","準備のできた"],
["здоровый","健康な"],
["приятный","気持ちの良い・楽しい"],
["дверь","扉"],
["кровать","ベッド"],
["тихий","静かな"],
["внимательно","注意深く"],
["крепко","しっかりと"],
["наконец","ついに・やっと"],
["начинать","始める（不完）"],
["открывать","開ける・発見する（不完）"],
["слышать","聞こえる"],
["спать","眠る"],
["берег","岸"],
["год","年"],
["край","端"],
["лес","森"],
["санаторий","サナトリウム（長期療養施設）"],
["станция","（小さな）駅"],
["мальчик","少年"],
["название","（物の）名前・呼び名"],
["иностранный","外国の"],
["студенческий","学生の"],
["время","時間"],
["люди","人々"],
["настоящий","本当の・本物の"],
["прекрасный","とても美しい・とても素晴らしい"],
["весной","春に"],
["далеко","遠い・遠くに"],
["дальше","さらに・それから"],
["встречаться","会う・落ち合う（不完）"],
["за","〜の向こうに（＋造格）"],
["за городом","郊外で"]
],
[
["банк","銀行"],
["задача","課題"],
["роман","長篇小説"],
["рано","早く"],
["взять","取る（完）"],
["изучить","勉強する・研究する（完）"],
["кончать","終える（不完）"],
["кончить","終える（完）"],
["покупать","買う（不完）"],
["купить","買う（完）"],
["написать","書く（完）"],
["начать","始める（完）"],
["отдохнуть","休む（完）"],
["понравиться","気に入っている（完）"],
["посмотреть","見る（完）"],
["приготовить","準備する・用意する（完）"],
["прочитать","読む（完）"],
["решать","解く・決める（不完）"],
["решить","解く・決める（完）"],
["сделать","する（完）"],
["сказать","言う（完）"],
["весь","すべての"],
["звонить","電話する（不完）"],
["позвонить","電話する（完）"],
["учить","学んで覚える（不完）"],
["выучить","学んで覚える（完）"],
["сумка","鞄"],
["упражнение","練習問題"],
["остальной","残りの・それ以外の"],
["быстро","速く"],
["только","〜だけ"],
["встретиться","会う・落ち合う（完）"],
["знакомиться","知り合いになる（不完）"],
["познакомиться","知り合いになる（完）"],
["показать","見せる・案内する（完）"],
["спешить","急ぐ（不完）"],
["поспешить","急ぐ（完）"],
["успевать","間に合う（不完）"],
["успеть","間に合う（完）"]
],
[
["снова","再び"],
["вводить","導き入れる（不完）"],
["ввести","導き入れる（完）"],
["входить","入る（不完）"],
["войти","入る（完）"],
["выходить","出る（不完）"],
["выйти","出る（完）"],
["въезжать","乗り物で入る（不完）"],
["въехать","乗り物で入る（完）"],
["доходить","〜まで行く・来る（不完）"],
["дойти","〜まで行く・来る（完）"],
["заходить","立ち寄る（不完）"],
["зайти","立ち寄る（完）"],
["отходить","離れる（不完）"],
["отойти","離れる（完）"],
["переходить","横切って行く（不完）"],
["перейти","横切って行く（完）"],
["подходить","近づく（不完）"],
["подойти","近づく（完）"],
["пойти","出発する（完）"],
["походить","ちょっと歩く（完）"],
["приносить","（歩いて）持ってくる（不完）"],
["принести","（歩いて）持ってくる（完）"],
["приходить","到着する（不完）"],
["прийти","到着する（完）"],
["проходить","通って行く・来る（不完）"],
["пройти","通って行く・来る（完）"],
["уходить","去る（不完）"],
["уйти","去る（完）"],
["сесть","座る（完）"],
["пожалуйста","どうぞ・どういたしまして"],
["доезжать","〜まで乗り物で行く（不完）"],
["доехать","〜まで乗り物で行く（完）"],
["кончиться","終わる（完）"],
["приезжать","乗り物で到着する（不完）"],
["приехать","乗り物で到着する（完）"],
["деревня","村・田舎"],
["магазин","（商）店"],
["мост","橋"],
["соседний","隣の"],
["тот","あの・その"],
["легко","簡単に・たやすく"],
["направо","右に"],
["недалеко","近くに"],
["однажды","ある日・あるとき"],
["поэтому","だから・よって"],
["прямо","まっすぐ"],
["сначала","最初は"],
["встать","立ち上がる・起きる（完）"],
["находить","見つける（不完）"],
["найти","見つける（完）"],
["объяснять","説明する（不完）"],
["объяснить","説明する（完）"],
["позавтракать","朝食をとる（完）"],
["пообедать","昼食をとる（完）"],
["поужинать","夕食をとる（完）"],
["видеть","見える・会う・理解する（不完）"],
["увидеть","見える・会う・理解する（完）"],
["уставать","疲れる（不完）"],
["устать","疲れる（完）"],
["через","〜を越えて"]
],
[
["класс","（小中高の）学年"],
["минута","分"],
["лет","（５以上の）年・歳"],
["год","（４以下の）年・歳"],
["страница","ページ"],
["час","時"],
["этаж","階"],
["который","どの・（汎用的な関係代名詞）"],
["вставать","立ち上がる・起きる（不完）"],
["месяц","（日付）月"],
["рубль","（通貨単位）ルーブル"],
["экскурсия","遠足・団体観覧"],
["стоить","値段がする（不完；完了体なし）"],
["начинаться","始まる（不完）"],
["занятия","授業"],
["кончаться","終わる（不完）"],
["мочь","できる（不完）"],
["смочь","できる（完）"],
["алло","もしもし"]
],
[
["гора","山"],
["здоровье","健康"],
["мир","世界・平和"],
["больший","より大きい（長語尾形）"],
["далёкий","遠い"],
["дорогой","高価な・大切な"],
["лучший","より良い（長語尾形）"],
["меньший","より小さい（長語尾形）"],
["самый","（最上級）もっとも"],
["худший","より悪い（長語尾形）"],
["ближе","より近い（短語尾形）"],
["больше","より大きい（短語尾形）"],
["дороже","より高価な・より大切な（短語尾形）"],
["лучше","より良い（短語尾形）"],
["меньше","より小さい・より少ない（短語尾形）"],
["моложе","より若い（短語尾形）"],
["старше","より古い（短語尾形）"],
["хуже","より悪い（短語尾形）"],
["более","（比較級）より"],
["чем","〜よりも"],
["выше","より高い（短語尾形）"],
["талантливый","才能ある"],
["группа","グループ・集団"],
["жизнь","人生・生活・生命"],
["институт","研究所・単科大学"],
["младший","より若い（長語尾形）"],
["старший","より古い（長語尾形）"],
["оканчивать","（学校などを）終える（不完）"],
["окончить","（学校などを）終える（完）"],
["петь","歌う（不完）"],
["спеть","歌う（完）"],
["становиться","〜になる（＋造格）（不完）"],
["стать","〜になる（＋造格）（完）"]
],
[
["адрес","住所・アドレス"],
["себя","（再帰代名詞）自分自身"],
["свой","自分の"],
["прохладный","涼しい"],
["давать","与える（不完）"],
["дать","与える（完）"],
["забывать","忘れる（不完）"],
["забыть","忘れる（完）"],
["записывать","書き留める（不完）"],
["записать","書き留める（完）"],
["открыть","開ける・発見する（完）"],
["поговорить","ちょっと話す・相談する（完）"],
["сидеть","座っている（不完）"],
["чувствовать","感じる（不完）"],
["почувствовать","感じる（完）"],
["если","もし"],
["чтобы","〜ために・〜ように（願望表現など）"],
["бы","（仮定法を作る助詞）"],
["зеркало","鏡"],
["опаздывать","遅れる（不完）"],
["опоздать","遅れる（完）"],
["помочь","助ける・手伝う（完）"],
["просить","頼む・お願いする（不完）"],
["попросить","頼む・お願いする（完）"],
["за город","郊外へ"],
["география","地理"],
["земля","地球・地上"],
["человек","人・人間"],
["ответить","答える（完）"],
["плавать","泳ぐ（不定動詞）（不完）"],
["поплавать","泳ぐ（不定動詞）（完）"],
["плыть","泳ぐ（定動詞）（不完）"],
["поплыть","泳ぐ（定動詞）（完）"],
["для","〜のために"]
],
[
["девушка","少女・娘"],
["поехать","乗り物で出かける（完；不完了体なし）"],
["рассказать","話す・語る（完）"],
["рождаться","生まれる（不完）"],
["родиться","生まれる（完）"],
["без","（＋生格）〜なしで"],
["почему","なぜ"],
["давно","長い間・かなり前に"],
["находиться","見つかる・ある・位置する（不完）"],
["найтись","見つかる（不完）"],
["спросить","尋ねる・訊く（完）"],
["хозяйка","女主人"]
],
[
["закрываться","閉まる（不完）"],
["закрыться","閉まる（完）"],
["закрывать","閉める（不完）"],
["закрыть","閉める（完）"],
["переводить","翻訳する（不完）"],
["перевести","翻訳する（完）"],
["показывать","見せる・案内する（不完）"],
["крыть","覆う（不完）"],
["покрыть","覆う（完）"],
["построить","建てる（完）"],
["терять","なくす（不完）"],
["потерять","なくす（完）"],
["приглашать","招待する（不完）"],
["пригласить","招待する（完）"],
["уважать","尊敬する（不完；完了体なし）"],
["вопрос","質問"],
["выставка","展覧会・展示会"],
["январь","一月・睦月"],
["февраль","二月・如月"],
["март","三月・弥生"],
["апрель","四月・卯月"],
["май","五月・皐月"],
["июнь","六月・水無月"],
["июль","七月・文月"],
["август","八月・葉月"],
["сентябрь","九月・長月"],
["октябрь","十月・神無月"],
["ноябрь","十一月・霜月"],
["декабрь","十二月・師走"],
["заканчивать","終える（不完）"],
["закончить","終える（完）"],
["дарить","贈る・プレゼントする（不完）"],
["подарить","贈る・プレゼントする（完）"],
["получить","受け取る（完）"],
["привозить","乗り物で運んでくる（不完）"],
["привезти","乗り物で運んでくる（完）"],
["цветы","花（複数）"],
["цветок","花（単数）"],
["открытка","葉書・ポストカード"],
["праздник","祝日・休日"]
],
[
["автор","著者・作者・作曲者"],
["общежитие","寮"],
["отопление","暖房"],
["работник","従業員"],
["жаловаться","不平を言う・訴える"],
["искать","探す（不完）"],
["поискать","探す（完）"],
["кричать","叫ぶ（不完）"],
["закричать","叫ぶ（不完）"],
["ложиться","横たわる（不完）"],
["лечь","横たわる（不完）"],
["мешать","邪魔する・混ぜる（不完）"],
["помешать","邪魔する（完）"],
["смешать","混ぜる（完）"],
["научиться","習い覚える（完）"],
["народ","国民・民族・民衆・人々"],
["проблема","問題"],
["важный","大事な・重要な"],
["великий","偉大な"],
["другой","別の"],
["около","〜のそば・〜の脇（＋生格）"]//текстは後程追加
]
];

let section_numbers = [];
let whether_selected = [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0];
let selected_word_number = 0;
let new_dictionary = [];
let miss_list = [];

let Japanese_word;
let words_entry;
let button;
let circle;
let miss_table;

let question;
let answer;

let current_status = 0;


//一次元配列を二次元配列にする関数（復元用）
function onedim_to_twodim(array, size){
    return array.flatMap((_, i, a) => i % size ? [] : [array.slice(i, i + size)]);
}


//前回の続きから始める場合の処理
function continue_process(){
    if (localStorage.getItem('running_flag_rwc') == 1) {
        section_numbers = localStorage.getItem('section_numbers_rwc').split(',').map(Number);
        whether_selected = localStorage.getItem('whether_selected_rwc').split(',').map(Number);
        selected_word_number = Number(localStorage.getItem('selected_word_number_rwc'));
        new_dictionary = onedim_to_twodim(localStorage.getItem('new_dictionary_rwc').split('|'), 2);
        miss_list = onedim_to_twodim(localStorage.getItem('miss_list_rwc').split('|'), 2);
        Japanese_word = document.getElementById("Japanese_word");
        words_entry = document.getElementById("words_entry");
        button = document.getElementById("decision");
        circle = document.getElementById("circle");
        miss_table = document.getElementById("miss_table");
        
        miss_table.innerHTML = localStorage.getItem('miss_table_rwc');
        question = localStorage.getItem('question_rwc');
        answer = localStorage.getItem('answer_rwc');
        current_status = Number(localStorage.getItem('current_status_rwc'));
        
        let start_setting = document.getElementById("start_setting");
        start_setting.style.display = "none";
        let quiz_area = document.getElementById("quiz_area");
        quiz_area.style.display = "block";
        let table_container = document.getElementById("table_container");
        table_container.style.display = "block";
        
        console.log(section_numbers, whether_selected, selected_word_number, new_dictionary, miss_list, miss_table.innerHTML, question, answer, current_status);
        
        //最初一問だけ、word_selectでは捌けないのでここで処理する
        words_entry.style.color = "black";
        words_entry.value = "";
        circle.style.visibility = "hidden";
        if (current_status == 0) {
            Japanese_word.innerHTML = question;
            button.innerHTML = "決定（Enterキーで代用）";
            button.setAttribute("onclick", "check()");
            circle.style.visibility = "hidden";
        }
        else {
            button.innerHTML = "誤答を周回";
            button.setAttribute("onclick", "next_round()");
        }
    }else {
        alert("進捗が保存されていません。最初から始めます。");
        return;
    }
}


function starter () {
    if (localStorage.getItem('running_flag_rwc') == 1) {
        if (confirm("前回の進捗は消去されますが、よろしいですか？") == false) {
            return;
        }
    }
    
    localStorage.removeItem('running_flag_rwc');
    localStorage.removeItem('section_numbers_rwc');
    localStorage.removeItem('whether_selected_rwc');
    localStorage.removeItem('selected_word_number_rwc');
    localStorage.removeItem('new_dictionary_rwc');
    localStorage.removeItem('miss_list_rwc');
    localStorage.removeItem('miss_table_rwc');
    localStorage.removeItem('question_rwc');
    localStorage.removeItem('answer_rwc');
    localStorage.removeItem('current_status_rwc');
    
    Japanese_word = document.getElementById("Japanese_word");
    words_entry = document.getElementById("words_entry");
    button = document.getElementById("decision");
    circle = document.getElementById("circle");
    miss_table = document.getElementById("miss_table");

    let checker = setting();
    if (checker == 1) {
        alert("１つ以上のセクションを選択してね！");
        return;
    }else {
        localStorage.setItem('running_flag_rwc', 1);
        word_select(1);
        let start_setting = document.getElementById("start_setting");
        start_setting.style.display = "none";
        let quiz_area = document.getElementById("quiz_area");
        quiz_area.style.display = "block";
        let table_container = document.getElementById("table_container");
        table_container.style.display = "block";
    }
}


//初期設定
function setting() {
    let selected_number = 0;
    for (let i = 1; i < dictionary.length + 1; i++) {
        let section = document.getElementById(`sec${("00"+i).slice(-2)}`);
        if (section.checked) {
            whether_selected[i - 1] = 1;
            selected_number++;
        }
    }
    if (selected_number == 0) {
        return 1;
    }

    for (let i = 0; i < dictionary.length; i++) {
        section_numbers.push(dictionary[i].length);
        selected_word_number += section_numbers[i] * whether_selected[i];
    }
    
    for (let i = 0; i < dictionary.length; i++) {
        if (whether_selected[i] == 0) {
            continue;
        }else {
            new_dictionary = new_dictionary.concat(dictionary[i]);
        }
    }
    
    localStorage.setItem('section_numbers_rwc', section_numbers);
    localStorage.setItem('whether_selected_rwc', whether_selected);
    return 0;
}


//問題を提示する
function word_select(attribute = 0) {
    if (current_status == 1) {
    	return;
    }
    
    if ((selected_word_number == 0) && (attribute == 0)) {
        alert("走破！お疲れ様！");
        current_status = 1;
        localStorage.setItem('current_status_rwc', current_status);
        if (miss_list.length == 0) {
            alert("全問題制覇！やったね！");
            localStorage.setItem('running_flag_rwc', 0);
            localStorage.removeItem('section_numbers_rwc');
            localStorage.removeItem('whether_selected_rwc');
            localStorage.removeItem('selected_word_number_rwc');
            localStorage.removeItem('new_dictionary_rwc');
            localStorage.removeItem('miss_list_rwc');
            localStorage.removeItem('miss_table_rwc');
            localStorage.removeItem('question_rwc');
            localStorage.removeItem('answer_rwc');
            localStorage.removeItem('current_status_rwc');
            button.innerHTML = "再読み込み";
            button.setAttribute("onclick", "location.reload()");
        }else {
            button.innerHTML = "誤答を周回";
            button.setAttribute("onclick", "next_round()");
        }
        return;
    }
    
    words_entry.removeAttribute("readonly");
    let chosen = Math.floor(Math.random()*selected_word_number);
    question = new_dictionary[chosen][1];
    answer= new_dictionary[chosen][0];
    localStorage.setItem('question_rwc', question);
    localStorage.setItem('answer_rwc', answer);
    Japanese_word.innerHTML = question;
    words_entry.style.color = "black";
    words_entry.value = "";
    
    selected_word_number --;
    new_dictionary.splice(chosen, 1);
    localStorage.setItem('selected_word_number_rwc', selected_word_number);
    localStorage.setItem('new_dictionary_rwc', new_dictionary.flat().join('|'));
    button.innerHTML = "決定（Enterキーで代用）";
    button.setAttribute("onclick", "check()");
    circle.style.visibility = "hidden";
    return;
}


//正誤判定
function check() {
    if (current_status == 1) {
    	return;
    }
    
    words_entry.setAttribute("readonly", true);
    if (words_entry.value == answer) {
        circle.style.visibility = "visible";
    }else {
        let new_missing = document.createElement("tr");
        new_missing.innerHTML = `<th>${question}</th><th>${words_entry.value}</th><th>${answer}</th>`;
        miss_table.appendChild(new_missing);
        miss_list.push([answer,question]);
        localStorage.setItem('miss_list_rwc', miss_list.flat().join('|'));
        localStorage.setItem('miss_table_rwc', miss_table.innerHTML);
        words_entry.style.color = "red";
        words_entry.value = answer;
    }
    
    button.innerHTML = "次へ（Enterキーで代用）";
    button.setAttribute("onclick", "word_select()");
}


function next_round() {
    new_dictionary = miss_list.slice();
    localStorage.setItem('new_dictionary_rwc', new_dictionary.flat().join('|'));
    current_status = 0;
    localStorage.setItem('current_status_rwc', current_status);
    miss_list = [];
    localStorage.setItem('miss_list_rwc', miss_list.flat().join('|'));
    selected_word_number = new_dictionary.length;
    localStorage.setItem('selected_word_number', selected_word_number);
    miss_table.innerHTML = "<tr><th>問題</th><th>あなたの解答</th><th>正答</th></tr>";
    localStorage.setItem('miss_table_rwc', miss_table);
    word_select(1);
}


document.addEventListener('keydown', (event) => {
    let key = event.key;
        
    if (key == "Enter") {
        event.preventDefault();
        if (button.getAttribute("onclick") == "check()") {
            check();
        }else if (button.getAttribute("onclick") == "word_select()") {
        	word_select();
        }else {
        	return;
        }
    }
});
